Tekla Open API Reference for Tekla Structures 2025
ModelObject.SetUserProperties Method
 Sets multiple properties for the model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetUserProperties(
	List<string> stringPropertyNames,
	List<string> stringValues,
	List<string> doublePropertyNames,
	List<double> doubleValues,
	List<string> intPropertyNames,
	List<int> intValues
)
Public Function SetUserProperties (
	stringPropertyNames As List(Of String),
	stringValues As List(Of String),
	doublePropertyNames As List(Of String),
	doubleValues As List(Of Double),
	intPropertyNames As List(Of String),
	intValues As List(Of Integer)
) As Boolean
Parameters
stringPropertyNames
Type: System.Collections.Generic.List<String>
The names of the string properties to be set.
stringValues
Type: System.Collections.Generic.List<String>
The new values for the string properties.
doublePropertyNames
Type: System.Collections.Generic.List<String>
The names of the double properties to be set.
doubleValues
Type: System.Collections.Generic.List<Double>
The new values for the double properties.
intPropertyNames
Type: System.Collections.Generic.List<String>
The names of the int properties to be set.
intValues
Type: System.Collections.Generic.List<Int32>
The new values for the int properties.
Return Value
Type: Boolean
True if the property was set successfully.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace